In [1]:
%load_ext sql

In [2]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

'Connected: student@sparkifydb'

In [3]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(UUID('c1047178-1f6f-5ee6-b54b-2712f3e7d618'), datetime.datetime(2018, 11, 29, 0, 0, 57, 796000), 73, 'paid', None, None, 954, 'Tampa-St. Petersburg-Clearwater, FL', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"'),
 (UUID('13addd2b-ef93-584c-96f1-7658be24a476'), datetime.datetime(2018, 11, 29, 0, 1, 30, 796000), 24, 'paid', None, None, 984, 'Lake Havasu City-Kingman, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"'),
 (UUID('7f395ae0-7f50-582a-96db-2f5319d2d4fa'), datetime.datetime(2018, 11, 29, 0, 4, 1, 796000), 24, 'paid', None, None, 984, 'Lake Havasu City-Kingman, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"'),
 (UUID('3e06382e-2751-539b-89cb-571db1d18a12'), datetime.datetime(2018, 11, 29, 0, 4, 55, 796000), 73, 'paid', None, None, 954, 'Tampa-St. Petersburg-Clearwater, FL', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"'),
 (UUID('e1a61fa1-4b57-5480-ae2b-543ef2c87923'), datetime.datetime(2018, 11, 29, 0, 7, 13, 796000), 24, 'paid', None, None, 984, 'Lake Havasu City-Kingman, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"')]

In [4]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(79, 'James', 'Martin', 'M', 'free', datetime.datetime(2018, 11, 29, 15, 20, 30, 796000)),
 (78, 'Chloe', 'Roth', 'F', 'free', datetime.datetime(2018, 11, 29, 11, 3, 31, 796000)),
 (14, 'Theodore', 'Harris', 'M', 'free', datetime.datetime(2018, 11, 29, 4, 55, 55, 796000)),
 (52, 'Theodore', 'Smith', 'M', 'free', datetime.datetime(2018, 11, 29, 4, 27, 16, 796000)),
 (98, 'Jordyn', 'Powell', 'F', 'free', datetime.datetime(2018, 11, 29, 8, 18, 42, 796000))]

In [5]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('SOFNOQK12AB01840FC', 'Kutt Free (DJ Volume Remix)', 'ARNNKDK1187B98BBD5', 0, Decimal('407.37914')),
 ('SOBAYLL12A8C138AF9', 'Sono andati? Fingevo di dormire', 'ARDR4AC1187FB371A1', 0, Decimal('511.16363')),
 ('SOFFKZS12AB017F194', 'A Higher Place (Album Version)', 'ARBEBBY1187B9B43DB', 1994, Decimal('236.17261')),
 ('SOGVQGJ12AB017F169', 'Ten Tonne', 'AR62SOJ1187FB47BB5', 2005, Decimal('337.68444')),
 ('SOXILUQ12A58A7C72A', 'Jenny Take a Ride', 'ARP6N5A1187B99D1A3', 2004, Decimal('207.43791'))]

In [6]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('ARNNKDK1187B98BBD5', 'Jinx', 'Zagreb Croatia', 45.80726, 15.9676),
 ('ARDR4AC1187FB371A1', 'Montserrat Caballé;Placido Domingo;Vicente Sardinero;Judith Blegen;Sherrill Milnes;Georg Solti', '', nan, nan),
 ('ARBEBBY1187B9B43DB', 'Tom Petty', 'Gainesville, FL', nan, nan),
 ('AR62SOJ1187FB47BB5', 'Chase & Status', '', nan, nan),
 ('ARP6N5A1187B99D1A3', 'Mitch Ryder', 'Hamtramck, MI', nan, nan)]

In [7]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(datetime.datetime(2018, 11, 29, 0, 0, 57, 796000), 0, 29, 48, 11, 2018, 3),
 (datetime.datetime(2018, 11, 29, 0, 1, 30, 796000), 0, 29, 48, 11, 2018, 3),
 (datetime.datetime(2018, 11, 29, 0, 4, 1, 796000), 0, 29, 48, 11, 2018, 3),
 (datetime.datetime(2018, 11, 29, 0, 4, 55, 796000), 0, 29, 48, 11, 2018, 3),
 (datetime.datetime(2018, 11, 29, 0, 7, 13, 796000), 0, 29, 48, 11, 2018, 3)]

In [8]:
%sql SELECT s.start_time as s_start_time, t.start_time as t_start_time FROM songplays s INNER JOIN time t on s.start_time = t.start_time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(datetime.datetime(2018, 11, 29, 0, 0, 57, 796000), datetime.datetime(2018, 11, 29, 0, 0, 57, 796000)),
 (datetime.datetime(2018, 11, 29, 0, 1, 30, 796000), datetime.datetime(2018, 11, 29, 0, 1, 30, 796000)),
 (datetime.datetime(2018, 11, 29, 0, 4, 1, 796000), datetime.datetime(2018, 11, 29, 0, 4, 1, 796000)),
 (datetime.datetime(2018, 11, 29, 0, 4, 55, 796000), datetime.datetime(2018, 11, 29, 0, 4, 55, 796000)),
 (datetime.datetime(2018, 11, 29, 0, 7, 13, 796000), datetime.datetime(2018, 11, 29, 0, 7, 13, 796000))]

In [9]:
%sql SELECT tm.weekday, COUNT(sp.songplay_id) as songplay_count FROM songplays sp LEFT JOIN time tm on sp.start_time = tm.start_time GROUP BY tm.weekday ORDER BY tm.weekday;

 * postgresql://student:***@127.0.0.1/sparkifydb
7 rows affected.

[(0, 1014), (1, 1071), (2, 1364), (3, 1052), (4, 1295), (5, 628), (6, 396)]

In [10]:
%sql SELECT tm.month, tm.year, COUNT(sp.songplay_id) as songplay_count FROM songplays sp LEFT JOIN time tm on sp.start_time = tm.start_time GROUP BY tm.month, tm.year;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(11, 2018, 6820)]

In [11]:
%sql SELECT sp.level, COUNT(sp.songplay_id) as songplay_count, 100*COUNT(sp.songplay_id)/(select count(s.songplay_id) from songplays s) as percent FROM songplays sp GROUP BY sp.level;

 * postgresql://student:***@127.0.0.1/sparkifydb
2 rows affected.

[('free', 1229, 18), ('paid', 5591, 81)]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).